# Members Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss..::..Members Property
Truss Class See Also
---
Get all the members of truss.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ICollection<ElementId> Members { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Members As ICollection(Of ElementId)
	Get
```

Visual C++
---
```text
public:
property ICollection<ElementId^>^ Members {
	ICollection<ElementId^>^ get ();
}
```

# ### Return Value
The Members property returns an ElementIdSet that contains all the member Ids of truss.
# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace